/************************* Copyright (c) 2018   AJS.Sunwaz  *****************************
 *项目名称:	CA9523M
 *描    述:	无线中继器(自组网型)
 *设    计:	AJS.Sunwaz,王泉凯
 *修改日期:	2018-03-07					文档移植
						2018-03-09					对移植内容进行了修改( 针对本项目的 LED相关显示进行修改 )
 *说    明:	本文档为网络应用文档
*******************************************************************************************/
/* 头文件	--------------------------------------------------------------------*/
#include "app_net.h"
#include "key_led.h"
#include "configure.h"
#include "bc95.h"
#include "nbiot.h"
#include "transmission.h"
//#include "app.h"

#include "adc_get.h"
#include "timer.h"
#include "delay.h"
#include "com.h"

/* 宏定义	--------------------------------------------------------------------*/
#define ALARM_TIME   									6                   //右移6位    (6->64s 7->128s 8->256s 9->512s)

#define ID_Base_Addr           				0x1FFFF7AC					//芯片的唯一ID基地址

#define delay_nms 										delay_ms
 
#define Slaveadderss_MAX              5                   //最大探测器个数
																			
/* 结构体定义	----------------------------------------------------------------*/
/* 内部引用	------------------------------------------------------------------*/
/* 全局变量	------------------------------------------------------------------*/
/* 系统函数	------------------------------------------------------------------*/




/*------------------------------File----------End------------------------------*/
