/************************* Copyright (c) 2018   AJS.Sunwaz  *****************************
 *项目名称:	CA9523M
 *描    述:	智慧用电
 *设    计:	AJS.Sunwaz
 *修改日期:	2018-03-08					文档移植
 *说    明:	
*******************************************************************************************/
/* 头文件	--------------------------------------------------------------------*/
#include "delay.h"
/* 宏定义	--------------------------------------------------------------------*/
/* 结构体定义	----------------------------------------------------------------*/
/* 内部引用	------------------------------------------------------------------*/
/* 全局变量	------------------------------------------------------------------*/
static uint8_t  fac_us=0;							//us延时倍乘数			   
static uint16_t fac_ms=0;							//ms延时倍乘数,在ucos下,代表每个节拍的ms数
/* 系统函数	------------------------------------------------------------------*/
/*****************************************************************************
 * 函数功能:		初始化延迟函数  SYSTICK的时钟固定为HCLK时钟的1/8
 * 形式参数:		无
 * 返回参数:		无
 * 更改日期;		2018-03-08				函数编写
 ****************************************************************************/ 
void delay_init()
{
	SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK_Div8);	//选择外部时钟  HCLK/8
	fac_us=SystemCoreClock/8000000;				//为系统时钟的1/8  
	fac_ms=(uint16_t)fac_us*1000;					//非OS下,代表每个ms需要的systick时钟数   
}	
/*****************************************************************************
 * 函数功能:		延时nus
 * 形式参数:		nus为要延时的us数
 * 返回参数:		无
 * 更改日期;		2018-03-08				函数移植
 ****************************************************************************/     								   
void delay_us(uint32_t nus)
{		
	uint32_t temp;
	
	SysTick->LOAD=nus*fac_us; 					//时间加载	  		 
	SysTick->VAL=0x00;        					//清空计数器
	SysTick->CTRL|=SysTick_CTRL_ENABLE_Msk ;	//开始倒数	  
	do
	{
		temp=SysTick->CTRL;
	}while((temp&0x01)&&!(temp&(1<<16)));		//等待时间到达   
	SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;	//关闭计数器
	SysTick->VAL =0X00;      					 //清空计数器	 
}
/*****************************************************************************
 * 函数功能:		延时nms   注意nms的范围 最大位1864
 * 形式参数:		nus为要延时的us数
 * 返回参数:		无
 * 注意事项;		nus为要延时的us数 nms<=0xffffff*8*1000/SYSCLK
								nms<=0xffffff*8*1000/SYSCLK
								SYSCLK单位为Hz,nms单位为ms
								对48M条件下,nms<=2796 
 * 更改日期;		2018-03-08				函数移植
 ****************************************************************************/  
void delay_ms(uint16_t nms)
{	 		  	  
	uint32_t temp;		
	
	SysTick->LOAD=(uint32_t)nms*fac_ms;				//时间加载(SysTick->LOAD为24bit)
	SysTick->VAL =0x00;							//清空计数器
	SysTick->CTRL|=SysTick_CTRL_ENABLE_Msk ;	//开始倒数  
	do
	{
		temp=SysTick->CTRL;
	}while((temp&0x01)&&!(temp&(1<<16)));		//等待时间到达   
	SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;	//关闭计数器
	SysTick->VAL =0X00;       					//清空计数器	  	    
} 
/*------------------------------File----------End------------------------------*/
