/************************* Copyright (c) 2018   AJS.Sunwaz  *****************************
 *项目名称:	CA9523M
 *描    述:	无线中继器(自组网型)
 *设    计:	AJS.Sunwaz,王泉凯
 *修改日期:	2018/03/08
 *说    明:	2018-03-08					文档移植
*******************************************************************************************/
#ifndef __RTC_H
#define __RTC_H
/* 头文件	--------------------------------------------------------------------*/
#include "stm32f0xx.h"
/* 宏定义	--------------------------------------------------------------------*/
/* 结构体定义	----------------------------------------------------------------*/		
typedef struct{												//时间结构
	uint8_t sec;												//秒
	uint8_t min;												//分
	uint8_t hour;												//时
	uint8_t day;												//日
	uint8_t mon;												//月
	uint8_t year;												//年
}Time_TypeDef_t;
/* 内部引用	------------------------------------------------------------------*/
/* 全局变量	------------------------------------------------------------------*/
extern Time_TypeDef_t Time;						//系统时钟结构体
/* 外部接口	------------------------------------------------------------------*/
uint8_t RTC_Config(void);							//初始化RTC,返回0,失败;1,成功;
uint8_t RTC_Get(void);         				//更新时间   
uint8_t RTC_Set(uint16_t syear,uint8_t smon,uint8_t sday,uint8_t hour,uint8_t min,uint8_t sec);//设置时间	
#endif /* __RTC_H end */
/*------------------------------File----------End------------------------------*/
