/************************* Copyright (c) 2018   AJS.Sunwaz  *****************************
 *项目名称:	CA9523M
 *描    述:	智慧用电
 *设    计:	AJS.Sunwaz
 *修改日期:	2018-03-07					文档编写
 *说    明:	
*******************************************************************************************/
#ifndef __BC95_H
#define __BC95_H
/* 头文件	--------------------------------------------------------------------*/
#include <stm32f0xx.h>
/* 宏定义	--------------------------------------------------------------------*/
/* 结构体定义	----------------------------------------------------------------*/
/* 内部引用	------------------------------------------------------------------*/
/* 全局变量	------------------------------------------------------------------*/
/* 外部接口	------------------------------------------------------------------*/
ErrorStatus BC95_init( uint8_t* cnt , uint8_t *flag);
ErrorStatus BC95_SendData(uint8_t *p , uint16_t len);
void BC95_ReceiveData( uint8_t* cnt);
void BC95_CSQ(uint8_t *buf);
void BC95_ReadSignal(uint8_t *buf);
void BC95_ReadPCI(uint8_t *buf);
void BC95_ReadCellID(uint8_t *buf);
void BC95_ReadSNR(uint8_t *buf);
void BC95_Reset(void);
#endif /* __BC95_H end */
/*------------------------------File----------End------------------------------*/
